Autodesk.Revit.DB.Analysis.MassSurfaceDataSource
Indicates whether values for the properties of the MassSurfaceData
are synchronized with the EnergyDataSettings of the
document or instead, serve as overrides of those settings.
Since:
2012

Autodesk.Revit.DB.Analysis.MassSurfaceDataSource.Surface
Override the EnergyDataSettings values for the surface.

Autodesk.Revit.DB.Analysis.MassSurfaceDataSource.EnergyData
Synchronize with the EnergyDataSettings.

Autodesk.Revit.DB.Analysis.MassSurfaceDataSource.Invalid
This value indicates that the parameter has not been properly set.